# Лабораторная работа №14
## Тема: Тестирование и отладка программного обеспечения

### Цель работы:
Освоить методы автоматического тестирования и логирования в Python.

### Задание:
Разработать систему подсчёта средней оценки студента и проверить её при помощи unittest.

### Структура:
- main.py — основная программа
- test_main.py — модульные тесты
- app.log — файл логов
- README.md — отчёт

### Запуск программы:
python main.py

### Запуск тестов:
python test_main.py

### Используемые технологии:
- Python
- unittest
- logging

### Автор:
ФИО: ____________________
Группа: __________________
Дата: ____________________